## Plan for org_account/aft
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 18 to add, 21 to change, 5 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                                        NAME                                                                         |
|----------|-----------------------------------------------------------------------------------------------------------------------------------------------------|
| add      | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_default_security_group.aft_vpc_default_sg[0]`                        |
|          | `module.account_factory_for_terraform.module.aft_backend.aws_kms_key.aft_access_logs_primary_backend_bucket`                                        |
|          | `module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket.aft_access_logs_primary_backend_bucket`                                      |
|          | `module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_lifecycle_configuration.aft_access_logs_primary_backend_bucket`              |
|          | `module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_logging.primary-backend-bucket-logging`                                      |
|          | `module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_policy.aft_access_logs_primary_backend_bucket`                               |
|          | `module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_public_access_block.aft_access_logs_primary_backend_bucket`                  |
|          | `module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_server_side_encryption_configuration.aft_access_logs_primary_backend_bucket` |
|          | `module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_versioning.aft_access_logs_primary_backend_bucket`                           |
|          | `module.account_factory_for_terraform.module.aft_code_repositories.time_sleep.iam_eventual_consistency`                                             |
|          | `module.account_factory_for_terraform.module.aft_customizations.time_sleep.wait_for_iam_eventual_consistency`                                       |
|          | `module.account_factory_for_terraform.module.aft_lambda_layer.aws_cloudwatch_log_group.codebuild_loggroup`                                          |
|          | `module.account_factory_for_terraform.module.aft_lambda_layer.aws_cloudwatch_log_group.codebuild_trigger_loggroup`                                  |
|          | `module.account_factory_for_terraform.module.aft_lambda_layer.aws_iam_role.codebuild_trigger_lambda_role`                                           |
|          | `module.account_factory_for_terraform.module.aft_lambda_layer.aws_iam_role_policy.codebuild_trigger_policy`                                         |
|          | `module.account_factory_for_terraform.module.aft_lambda_layer.aws_iam_role_policy_attachment.codebuild_trigger_VPC_access`                          |
|          | `module.account_factory_for_terraform.module.aft_lambda_layer.aws_lambda_function.codebuild_trigger`                                                |
| delete   | `module.account_factory_for_terraform.module.aft_lambda_layer.aws_iam_role.codebuild_invoker_lambda_role`                                           |
|          | `module.account_factory_for_terraform.module.aft_lambda_layer.aws_iam_role_policy.codebuild_invoker_policy`                                         |
|          | `module.account_factory_for_terraform.module.aft_lambda_layer.aws_iam_role_policy_attachment.codebuild_invoker_VPC_access`                          |
|          | `module.account_factory_for_terraform.module.aft_lambda_layer.aws_lambda_function.codebuild_invoker`                                                |
| update   | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.account_metadata_ssm`                           |
|          | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.create_role`                                    |
|          | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.persist_metadata`                               |
|          | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.tag_account`                                    |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_action_trigger`                  |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_audit_trigger`                   |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_processor`                       |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_cleanup_resources`                               |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_controltower_event_logger`                       |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_invoke_aft_account_provisioning_framework`       |
|          | `module.account_factory_for_terraform.module.aft_backend.aws_dynamodb_table.lock-table`                                                             |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_iam_role_policy.aft_invoke_customizations_sfn`                                  |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_execute_pipeline`                            |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_get_pipeline_executions`                     |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_identify_targets`                            |
|          | `module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_delete_default_vpc`                                        |
|          | `module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_enable_cloudtrail`                                         |
|          | `module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_enroll_support`                                            |
|          | `module.account_factory_for_terraform.module.aft_lambda_layer.aws_codebuild_project.codebuild`                                                      |
|          | `module.account_factory_for_terraform.module.aft_ssm_parameters.aws_ssm_parameter.aft_framework_repo_git_ref`                                       |
|          | `module.account_factory_for_terraform.module.aft_ssm_parameters.aws_ssm_parameter.aft_version`                                                      |
| recreate | `module.account_factory_for_terraform.module.aft_lambda_layer.aws_lambda_layer_version.layer_version`                                               |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/cds-aws-lz/actions/runs/10373003009).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.account_metadata_ssm will be updated in-place
  ~ resource "aws_lambda_function" "account_metadata_ssm" {
        id                             = "aft-account-provisioning-framework-account-metadata-ssm"
      ~ last_modified                  = "2024-01-23T19:21:41.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-11-1:1",
        ] -> (known after apply)
      ~ source_code_hash               = "QN7D+CUlOUfTFBQizcIrOFaxSz0brNxVVYNqG4c3vx4=" -> "nezljNvt1gxJZSNa7VmAuf96Botf6I7UXDwrf0UAGyU="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.create_role will be updated in-place
  ~ resource "aws_lambda_function" "create_role" {
        id                             = "aft-account-provisioning-framework-create-aft-execution-role"
      ~ last_modified                  = "2024-01-23T19:20:16.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-11-1:1",
        ] -> (known after apply)
      ~ source_code_hash               = "QN7D+CUlOUfTFBQizcIrOFaxSz0brNxVVYNqG4c3vx4=" -> "nezljNvt1gxJZSNa7VmAuf96Botf6I7UXDwrf0UAGyU="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.persist_metadata will be updated in-place
  ~ resource "aws_lambda_function" "persist_metadata" {
        id                             = "aft-account-provisioning-framework-persist-metadata"
      ~ last_modified                  = "2024-01-23T19:21:10.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-11-1:1",
        ] -> (known after apply)
      ~ source_code_hash               = "QN7D+CUlOUfTFBQizcIrOFaxSz0brNxVVYNqG4c3vx4=" -> "nezljNvt1gxJZSNa7VmAuf96Botf6I7UXDwrf0UAGyU="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.tag_account will be updated in-place
  ~ resource "aws_lambda_function" "tag_account" {
        id                             = "aft-account-provisioning-framework-tag-account"
      ~ last_modified                  = "2024-01-23T19:21:52.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-11-1:1",
        ] -> (known after apply)
      ~ source_code_hash               = "QN7D+CUlOUfTFBQizcIrOFaxSz0brNxVVYNqG4c3vx4=" -> "nezljNvt1gxJZSNa7VmAuf96Botf6I7UXDwrf0UAGyU="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_default_security_group.aft_vpc_default_sg[0] will be created
  + resource "aws_default_security_group" "aft_vpc_default_sg" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "aft-vpc-default-sg"
        }
      + tags_all               = {
          + "Name"       = "aft-vpc-default-sg"
          + "managed_by" = "AFT"
        }
      + vpc_id                 = "vpc-02d549c0062f746bf"
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_eip.aft-vpc-natgw-01 has moved to module.account_factory_for_terraform.module.aft_account_request_framework.aws_eip.aft-vpc-natgw-01[0]
    resource "aws_eip" "aft-vpc-natgw-01" {
        id                   = "eipalloc-05a26077e8ec0f1d3"
        tags                 = {}
        # (12 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_eip.aft-vpc-natgw-02 has moved to module.account_factory_for_terraform.module.aft_account_request_framework.aws_eip.aft-vpc-natgw-02[0]
    resource "aws_eip" "aft-vpc-natgw-02" {
        id                   = "eipalloc-0d0a91ae026aa8475"
        tags                 = {}
        # (12 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_internet_gateway.aft-vpc-igw has moved to module.account_factory_for_terraform.module.aft_account_request_framework.aws_internet_gateway.aft-vpc-igw[0]
    resource "aws_internet_gateway" "aft-vpc-igw" {
        id       = "igw-0fcaed4ed0df7bcd0"
        tags     = {
            "Name" = "aft-vpc-igw"
        }
        # (4 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_action_trigger will be updated in-place
  ~ resource "aws_lambda_function" "aft_account_request_action_trigger" {
        id                             = "aft-account-request-action-trigger"
      ~ last_modified                  = "2024-01-23T19:22:11.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-11-1:1",
        ] -> (known after apply)
      ~ source_code_hash               = "O43cmRGW4ZpqZTk42qSOolLrh8jVa3ztQ1qKsm880Aw=" -> "0nfsLpfASxR/8YukvJkrwtkYISYIwHwfZ9jhIMC+Rxo="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_audit_trigger will be updated in-place
  ~ resource "aws_lambda_function" "aft_account_request_audit_trigger" {
        id                             = "aft-account-request-audit-trigger"
      ~ last_modified                  = "2024-01-23T19:22:18.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-11-1:1",
        ] -> (known after apply)
      ~ source_code_hash               = "O43cmRGW4ZpqZTk42qSOolLrh8jVa3ztQ1qKsm880Aw=" -> "0nfsLpfASxR/8YukvJkrwtkYISYIwHwfZ9jhIMC+Rxo="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_processor will be updated in-place
  ~ resource "aws_lambda_function" "aft_account_request_processor" {
        id                             = "aft-account-request-processor"
      ~ last_modified                  = "2024-01-23T19:21:20.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-11-1:1",
        ] -> (known after apply)
      ~ source_code_hash               = "O43cmRGW4ZpqZTk42qSOolLrh8jVa3ztQ1qKsm880Aw=" -> "0nfsLpfASxR/8YukvJkrwtkYISYIwHwfZ9jhIMC+Rxo="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_cleanup_resources will be updated in-place
  ~ resource "aws_lambda_function" "aft_cleanup_resources" {
        id                             = "aft-cleanup-resources"
      ~ last_modified                  = "2024-01-23T19:22:39.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-11-1:1",
        ] -> (known after apply)
      ~ source_code_hash               = "O43cmRGW4ZpqZTk42qSOolLrh8jVa3ztQ1qKsm880Aw=" -> "0nfsLpfASxR/8YukvJkrwtkYISYIwHwfZ9jhIMC+Rxo="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_controltower_event_logger will be updated in-place
  ~ resource "aws_lambda_function" "aft_controltower_event_logger" {
        id                             = "aft-controltower-event-logger"
      ~ last_modified                  = "2024-01-23T19:20:37.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-11-1:1",
        ] -> (known after apply)
      ~ source_code_hash               = "O43cmRGW4ZpqZTk42qSOolLrh8jVa3ztQ1qKsm880Aw=" -> "0nfsLpfASxR/8YukvJkrwtkYISYIwHwfZ9jhIMC+Rxo="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_invoke_aft_account_provisioning_framework will be updated in-place
  ~ resource "aws_lambda_function" "aft_invoke_aft_account_provisioning_framework" {
        id                             = "aft-invoke-aft-account-provisioning-framework"
      ~ last_modified                  = "2024-01-23T19:21:30.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-11-1:1",
        ] -> (known after apply)
      ~ source_code_hash               = "O43cmRGW4ZpqZTk42qSOolLrh8jVa3ztQ1qKsm880Aw=" -> "0nfsLpfASxR/8YukvJkrwtkYISYIwHwfZ9jhIMC+Rxo="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_nat_gateway.aft-vpc-natgw-01 has moved to module.account_factory_for_terraform.module.aft_account_request_framework.aws_nat_gateway.aft-vpc-natgw-01[0]
    resource "aws_nat_gateway" "aft-vpc-natgw-01" {
        id                                 = "nat-020f1d0e97943194c"
        tags                               = {
            "Name" = "aft-vpc-natgw-01"
        }
        # (11 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_nat_gateway.aft-vpc-natgw-02 has moved to module.account_factory_for_terraform.module.aft_account_request_framework.aws_nat_gateway.aft-vpc-natgw-02[0]
    resource "aws_nat_gateway" "aft-vpc-natgw-02" {
        id                                 = "nat-0b43c3b2610e42920"
        tags                               = {
            "Name" = "aft-vpc-natgw-02"
        }
        # (11 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_route_table.aft_vpc_private_subnet_01 has moved to module.account_factory_for_terraform.module.aft_account_request_framework.aws_route_table.aft_vpc_private_subnet_01[0]
    resource "aws_route_table" "aft_vpc_private_subnet_01" {
        id               = "rtb-072393b539dfc06ec"
        tags             = {
            "Name" = "aft-vpc-private-subnet-01"
        }
        # (6 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_route_table.aft_vpc_private_subnet_02 has moved to module.account_factory_for_terraform.module.aft_account_request_framework.aws_route_table.aft_vpc_private_subnet_02[0]
    resource "aws_route_table" "aft_vpc_private_subnet_02" {
        id               = "rtb-0da22fd18e1bceb62"
        tags             = {
            "Name" = "aft-vpc-private-subnet-02"
        }
        # (6 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_route_table.aft_vpc_public_subnet_01 has moved to module.account_factory_for_terraform.module.aft_account_request_framework.aws_route_table.aft_vpc_public_subnet_01[0]
    resource "aws_route_table" "aft_vpc_public_subnet_01" {
        id               = "rtb-08f987e95d568ec8f"
        tags             = {
            "Name" = "aft-vpc-public-subnet-01"
        }
        # (6 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_route_table_association.aft_vpc_private_subnet_01 has moved to module.account_factory_for_terraform.module.aft_account_request_framework.aws_route_table_association.aft_vpc_private_subnet_01[0]
    resource "aws_route_table_association" "aft_vpc_private_subnet_01" {
        id             = "rtbassoc-0bd4bf2eb360b9428"
        # (2 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_route_table_association.aft_vpc_private_subnet_02 has moved to module.account_factory_for_terraform.module.aft_account_request_framework.aws_route_table_association.aft_vpc_private_subnet_02[0]
    resource "aws_route_table_association" "aft_vpc_private_subnet_02" {
        id             = "rtbassoc-0ba64e090b2288096"
        # (2 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_route_table_association.aft_vpc_public_subnet_01 has moved to module.account_factory_for_terraform.module.aft_account_request_framework.aws_route_table_association.aft_vpc_public_subnet_01[0]
    resource "aws_route_table_association" "aft_vpc_public_subnet_01" {
        id             = "rtbassoc-0614120153fa7f4d8"
        # (2 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_route_table_association.aft_vpc_public_subnet_02 has moved to module.account_factory_for_terraform.module.aft_account_request_framework.aws_route_table_association.aft_vpc_public_subnet_02[0]
    resource "aws_route_table_association" "aft_vpc_public_subnet_02" {
        id             = "rtbassoc-09a64ec7d05f10a5b"
        # (2 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_security_group.aft_vpc_default_sg has moved to module.account_factory_for_terraform.module.aft_account_request_framework.aws_security_group.aft_vpc_default_sg[0]
    resource "aws_security_group" "aft_vpc_default_sg" {
        id                     = "sg-0515a15a716538d46"
        name                   = "aft-default-sg"
        tags                   = {}
        # (8 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_security_group.aft_vpc_endpoint_sg has moved to module.account_factory_for_terraform.module.aft_account_request_framework.aws_security_group.aft_vpc_endpoint_sg[0]
    resource "aws_security_group" "aft_vpc_endpoint_sg" {
        id                     = "sg-09ad5043dda360531"
        name                   = "aft-endpoint-sg"
        tags                   = {}
        # (8 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_subnet.aft_vpc_private_subnet_01 has moved to module.account_factory_for_terraform.module.aft_account_request_framework.aws_subnet.aft_vpc_private_subnet_01[0]
    resource "aws_subnet" "aft_vpc_private_subnet_01" {
        id                                             = "subnet-0b05be0fc30c14b59"
        tags                                           = {
            "Name" = "aft-vpc-private-subnet-01"
        }
        # (16 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_subnet.aft_vpc_private_subnet_02 has moved to module.account_factory_for_terraform.module.aft_account_request_framework.aws_subnet.aft_vpc_private_subnet_02[0]
    resource "aws_subnet" "aft_vpc_private_subnet_02" {
        id                                             = "subnet-0c8091b136c716050"
        tags                                           = {
            "Name" = "aft-vpc-private-subnet-02"
        }
        # (16 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_subnet.aft_vpc_public_subnet_01 has moved to module.account_factory_for_terraform.module.aft_account_request_framework.aws_subnet.aft_vpc_public_subnet_01[0]
    resource "aws_subnet" "aft_vpc_public_subnet_01" {
        id                                             = "subnet-0a098ee22ff9a3adb"
        tags                                           = {
            "Name" = "aft-vpc-public-subnet-01"
        }
        # (16 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_subnet.aft_vpc_public_subnet_02 has moved to module.account_factory_for_terraform.module.aft_account_request_framework.aws_subnet.aft_vpc_public_subnet_02[0]
    resource "aws_subnet" "aft_vpc_public_subnet_02" {
        id                                             = "subnet-0e38193832fef5ab7"
        tags                                           = {
            "Name" = "aft-vpc-public-subnet-02"
        }
        # (16 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_vpc.aft_vpc has moved to module.account_factory_for_terraform.module.aft_account_request_framework.aws_vpc.aft_vpc[0]
    resource "aws_vpc" "aft_vpc" {
        id                                   = "vpc-02d549c0062f746bf"
        tags                                 = {
            "Name" = "aft-management-vpc"
        }
        # (15 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_dynamodb_table.lock-table will be updated in-place
  ~ resource "aws_dynamodb_table" "lock-table" {
        id                          = "aft-backend-137554749751"
        name                        = "aft-backend-137554749751"
        tags                        = {
            "Name" = "aft-backend-137554749751"
        }
        # (12 unchanged attributes hidden)

      - replica {
          - arn                    = "arn:aws:dynamodb:us-east-1:137554749751:table/aft-backend-137554749751" -> null
          - point_in_time_recovery = false -> null
          - propagate_tags         = false -> null
          - region_name            = "us-east-1" -> null
          - stream_arn             = "arn:aws:dynamodb:us-east-1:137554749751:table/aft-backend-137554749751/stream/2022-03-14T18:08:54.074" -> null
          - stream_label           = "2022-03-14T18:08:54.074" -> null
        }
      + replica {
          + arn                    = (known after apply)
          + kms_key_arn            = "arn:aws:kms:us-east-1:137554749751:key/e383ce05-f398-4791-b398-bbf911994c5e"
          + point_in_time_recovery = false
          + propagate_tags         = false
          + region_name            = "us-east-1"
          + stream_arn             = (known after apply)
          + stream_label           = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = "arn:aws:kms:ca-central-1:137554749751:key/cb27cd10-0c62-4c09-89e9-6e89af441c96"
        }

        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_kms_key.aft_access_logs_primary_backend_bucket will be created
  + resource "aws_kms_key" "aft_access_logs_primary_backend_bucket" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = (known after apply)
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "managed_by" = "AFT"
        }
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket.aft_access_logs_primary_backend_bucket will be created
  + resource "aws_s3_bucket" "aft_access_logs_primary_backend_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "aft-backend-137554749751-primary-region-access-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "managed_by" = "AFT"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_lifecycle_configuration.aft_access_logs_primary_backend_bucket will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "aft_access_logs_primary_backend_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "aft_primary_backend_bucket_access_logs_lifecycle_configuration_rule"
          + status = "Enabled"

          + filter {
              + prefix = "log/"
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 365
            }
        }
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_logging.primary-backend-bucket-logging will be created
  + resource "aws_s3_bucket_logging" "primary-backend-bucket-logging" {
      + bucket        = "aft-backend-137554749751-primary-region"
      + id            = (known after apply)
      + target_bucket = (known after apply)
      + target_prefix = "log/"
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_policy.aft_access_logs_primary_backend_bucket will be created
  + resource "aws_s3_bucket_policy" "aft_access_logs_primary_backend_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_public_access_block.aft_access_logs_primary_backend_bucket will be created
  + resource "aws_s3_bucket_public_access_block" "aft_access_logs_primary_backend_bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_server_side_encryption_configuration.aft_access_logs_primary_backend_bucket will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "aft_access_logs_primary_backend_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_versioning.aft_access_logs_primary_backend_bucket will be created
  + resource "aws_s3_bucket_versioning" "aft_access_logs_primary_backend_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.account_factory_for_terraform.module.aft_code_repositories.time_sleep.iam_eventual_consistency will be created
  + resource "time_sleep" "iam_eventual_consistency" {
      + create_duration = "60s"
      + id              = (known after apply)
    }

  # module.account_factory_for_terraform.module.aft_customizations.aws_iam_role_policy.aft_invoke_customizations_sfn will be updated in-place
  ~ resource "aws_iam_role_policy" "aft_invoke_customizations_sfn" {
        id     = "aft-invoke-customizations-execution-role:aft-invoke-customizations-policy"
        name   = "aft-invoke-customizations-policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = [
                            "sns:Publish",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:sns:ca-central-1:137554749751:aft-*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "states:StartExecution",
                          - "states:StopExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:states:ca-central-1:137554749751:stateMachine:aft-*",
                        ]
                    },
                    {
                        Action   = [
                            "events:PutTargets",
                            "events:PutRule",
                            "events:DescribeRule",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:events:ca-central-1:137554749751:*",
                        ]
                    },
                  ~ {
                      ~ Action   = [
                          - "states:DescribeExecution",
                          + "states:StartExecution",
                        ]
                      ~ Resource = [
                          - "arn:aws:states:ca-central-1:137554749751:execution:aft-*",
                          + "arn:aws:states:ca-central-1:137554749751:stateMachine:aft-*",
                        ]
                        # (1 unchanged attribute hidden)
                    },
                  + {
                      + Action   = [
                          + "states:DescribeExecution",
                          + "states:StopExecution",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:states:ca-central-1:137554749751:execution:aft-*",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_execute_pipeline will be updated in-place
  ~ resource "aws_lambda_function" "aft_customizations_execute_pipeline" {
        id                             = "aft-customizations-execute-pipeline"
      ~ last_modified                  = "2024-01-23T19:22:29.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-11-1:1",
        ] -> (known after apply)
      ~ source_code_hash               = "f0TqyHs9yKIa7KIZ6OoHgiyuEZoK6ZccuF1KOAoqNiw=" -> "Tfdb6jk/p+NxMglWqpPPoomxlrshvxTkE7imOqp2gu8="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_get_pipeline_executions will be updated in-place
  ~ resource "aws_lambda_function" "aft_customizations_get_pipeline_executions" {
        id                             = "aft-customizations-get-pipeline-executions"
      ~ last_modified                  = "2024-01-23T19:22:46.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-11-1:1",
        ] -> (known after apply)
      ~ source_code_hash               = "f0TqyHs9yKIa7KIZ6OoHgiyuEZoK6ZccuF1KOAoqNiw=" -> "Tfdb6jk/p+NxMglWqpPPoomxlrshvxTkE7imOqp2gu8="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  #...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.account_metadata_ssm"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.create_role"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.persist_metadata"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.tag_account"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_create_role"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_persist_metadata"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_tag_account"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_states"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.account_metadata_ssm"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.create_role"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.persist_metadata"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
